In [1]:
import pandas as pd

In [2]:
marks = pd.Series([10,20,30,40,50])
print(marks)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
marks = pd.Series([10,20,30,40,50],index=["Maths","Physics","Chemistry","Economics","Psychology"])
print(marks)

Maths         10
Physics       20
Chemistry     30
Economics     40
Psychology    50
dtype: int64

In [4]:
data = {
    "Name": ["Bhuvan","Ashish","Harsh Beniwal","Tanmay Bhat","Kishor Pathak","Hirosaki"],
    "Age": [24,25,28,45,60,29],
    "Marks": [80,90,40,30,92,77]
}

df = pd.DataFrame(data)
print(df)

            Name  Age  Marks
0         Bhuvan   24     80
1         Ashish   25     90
2  Harsh Beniwal   28     40
3    Tanmay Bhat   45     30
4  Kishor Pathak   60     92
5       Hirosaki   29     77

In [5]:
df.head()

            Name  Age  Marks
0         Bhuvan   24     80
1         Ashish   25     90
2  Harsh Beniwal   28     40
3    Tanmay Bhat   45     30
4  Kishor Pathak   60     92

In [6]:
df.tail()

            Name  Age  Marks
1         Ashish   25     90
2  Harsh Beniwal   28     40
3    Tanmay Bhat   45     30
4  Kishor Pathak   60     92
5       Hirosaki   29     77

In [7]:
df.describe()

             Age      Marks
count   6.000000   6.000000
mean   35.166667  68.166667
std    14.358505  26.505974
min    24.000000  30.000000
25%    25.750000  49.250000
50%    28.500000  78.500000
75%    41.000000  87.500000
max    60.000000  92.000000

In [8]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      str
 1   Age     6 non-null      int64
 2   Marks   6 non-null      int64
dtypes: int64(2), str(1)
memory usage: 276.0 bytes

In [9]:
df.dtypes

Name       str
Age      int64
Marks    int64
dtype: object

In [10]:
df["Name"]

0           Bhuvan
1           Ashish
2    Harsh Beniwal
3      Tanmay Bhat
4    Kishor Pathak
5         Hirosaki
Name: Name, dtype: str

In [11]:
df["Marks"]

0    80
1    90
2    40
3    30
4    92
5    77
Name: Marks, dtype: int64

In [12]:
df.loc[0]

Name     Bhuvan
Age          24
Marks        80
Name: 0, dtype: object

In [13]:
df["Passed"]=df["Marks"]>=85
df

            Name  Age  Marks  Passed
0         Bhuvan   24     80   False
1         Ashish   25     90    True
2  Harsh Beniwal   28     40   False
3    Tanmay Bhat   45     30   False
4  Kishor Pathak   60     92    True
5       Hirosaki   29     77   False

In [14]:
df["Marks"]=df["Marks"]+5
df

            Name  Age  Marks  Passed
0         Bhuvan   24     85   False
1         Ashish   25     95    True
2  Harsh Beniwal   28     45   False
3    Tanmay Bhat   45     35   False
4  Kishor Pathak   60     97    True
5       Hirosaki   29     82   False

In [15]:
high_scorers = df[df["Marks"]>90]
high_scorers

            Name  Age  Marks  Passed
1         Ashish   25     95    True
4  Kishor Pathak   60     97    True